
    /**
     * .                            _ooOoo_
     * .                           o8888888o
     * .                           88" . "88
     * .                           (| -_- |)
     * .                            O\ = /O
     * .                        ____/`---'\____
     * .                      .   ' \\| |// `.
     * .                       / \\||| : |||// \
     * .                     / _||||| -:- |||||- \
     * .                       | | \\\ - /// | |
     * .                     | \_| ''\---/'' | |
     * .                      \ .-\__ `-` ___/-. /
     * .                   ___`. .' /--.--\ `. . __
     * .                ."" '< `.___\_<|>_/___.' >'"".
     * .               | | : `- \`.;`\ _ /`;.`/ - ` : | |
     * .                 \ \ `-. \_ __\ /__ _/ .-` / /
     * .         ======`-.____`-.___\_____/___.-`____.-'======
     * .                            `=---='
     * .
     * .         ..............................................
     * .                  佛祖镇楼                  BUG辟易
     * .          佛曰:
     * .                  写字楼里写字间，写字间里程序员；
     * .                  程序人员写程序，又拿程序换酒钱。
     * .                  酒醒只在网上坐，酒醉还来网下眠；
     * .                  酒醉酒醒日复日，网上网下年复年。
     * .                  但愿老死电脑间，不愿鞠躬老板前；
     * .                  奔驰宝马贵者趣，公交自行程序员。
     * .                  别人笑我忒疯癫，我笑自己命太贱；
     * .                  不见满街漂亮妹，哪个归得程序员？
     * .
     * 项目名称: tomcat,PDA后台接口程序
     * 类名称: 包装类 PackingClass 
     * 创建人:Marks.Gao 创建时间:2024/5/15 09:39
     * V1.0.0.01 20240612 Marks新建 
     * V1.0.0.14 20241114 Marks 增加标签打印后复验的功能
     * V1.0.0.22 20250305 Marks 包装设置增加是否输入机台，增加机台输入框事件，过站时传入机台号保存
     * V1.0.0.28 20250521 Marks 外箱号码产生时尾部加上设定位数的内含数量
    **/
