#include<stdio.h>
int main()
{
	/*int i,a[5];    //以声明顺序连续放在内存,从高到低存储,i存入在数组a后面
	// int a[5],i;    //以声明顺序连续放在内存,从高到低存储
	for(i=1;i<=5;i++)
	{
		a[7] = 0;   //a[7]越界,实际地址为i的内存地址,把i改0导致程序死循环
		printf("i地址:%p\n",&i);
	}
	printf("%d\n %d\n %p\n %p\n %p\n %p\n %p\n %p\n %p\n",a[5],a[6],&a[0],&a[1],&a[2],&a[3],&a[4],&a[5],&a[7]);
	return 0;*/



	int i,a[3];    //以声明顺序连续放在内存,从高到低存储,i存入在数组a后面
	// int a[5],i;    //以声明顺序连续放在内存,从高到低存储
	for(i=1;i<=3;i++)
	{
		a[3] = 0;   //a[3]越界,实际地址为i的内存地址,把i改0导致程序死循环
		printf("i地址:%p\n %p\n",&i,&a[5]);
	}
	return 0;
}